{
    "cold_email": [
      {
        "title": "Internship Application",
        "template": "Subject: {Your Name} - {Position} Application\n\nDear {Recipient Name},\n\nI hope this email finds you well. My name is {Your Name}, a {Your Year} student at {Your University} studying {Your Major}. I am writing to express my interest in the {Position} position at {Company Name} that I found on {Job Board/Website}.\n\nWith my background in {Relevant Experience/Skills}, I am excited about the opportunity to contribute to {Company Name}'s {mention specific project or company goal if known}. {Additional sentence about how your skills align with the position}.\n\n{Brief paragraph about relevant coursework, projects, or experience}.\n\nI have attached my resume for your review, and I would welcome the opportunity to discuss how my skills and experiences align with the needs of your team. I am available for an interview at your convenience.\n\nThank you for considering my application. I look forward to the possibility of working with {Company Name}.\n\nSincerely,\n{Your Name}\n{Your Phone Number}\n{Your Email}"
      },
      {
        "title": "Networking Introduction",
        "template": "Subject: {Your University} Student - Seeking Career Advice in {Industry}\n\nDear {Recipient Name},\n\nI hope this email finds you well. My name is {Your Name}, a {Your Year} student at {Your University} majoring in {Your Major}. I discovered your profile through {how you found them - LinkedIn, company website, mutual connection, etc.} and was impressed by your work in {specific aspect of their career}.\n\nI am reaching out because I am very interested in pursuing a career in {specific field/industry} and would greatly value the opportunity to learn from your experience. If your schedule permits, I would appreciate a brief 15-20 minute conversation to discuss your career path and any insights you might have for someone looking to enter this field.\n\n{Optional: brief sentence about specific project or achievement of theirs you admire}.\n\nI understand you are busy, and I appreciate any time you might be able to offer. I am flexible and can work around your schedule.\n\nThank you for considering my request. I look forward to potentially connecting with you.\n\nBest regards,\n{Your Name}\n{Your University, Expected Graduation Year}\n{Your Email}\n{Your LinkedIn profile (optional)}"
      }
    ],
    "linkedin_message": [
      {
        "title": "Connection Request",
        "template": "Hi {Name}, I'm a {year} {major} student at {university}. I admired your work at {company} in {field}. Would love to connect and learn from your experience in the industry. Thanks!"
      },
      {
        "title": "Informational Interview",
        "template": "Hi {Name}, We're connected here on LinkedIn. I'm exploring careers in {industry} and your experience at {company} stands out. Would you be open to a 15-min chat about your career path? Thank you for considering."
      }
    ],
    "academic_email": [
      {
        "title": "Recommendation Letter Request",
        "template": "Subject: Request for Letter of Recommendation - {Your Name}\n\nDear Professor {Last Name},\n\nI hope this email finds you well. I am {Your Name}, a student from your {Course Name} class during the {Semester/Year} semester.\n\nI am writing to respectfully request a letter of recommendation for my application to {program/scholarship/job}. The deadline for submission is {date}, and I believe that your insight into my academic abilities would greatly strengthen my application.\n\nDuring your course, I {mention specific projects, papers, or contributions}. I particularly enjoyed {specific aspect of the course}, and I believe my performance demonstrated my {specific skills or qualities}.\n\n{Optional: brief paragraph about why you're applying to this opportunity and how it connects to the professor's course}.\n\nIf you agree to write this recommendation, I would be happy to provide additional information, including my resume, statement of purpose, and other relevant details about the position/program.\n\nI understand that writing a recommendation requires a significant time commitment, and I greatly appreciate your consideration of my request. Please let me know if you would be willing to provide this recommendation or if you need any additional information.\n\nThank you for your time and support.\n\nSincerely,\n{Your Name}\n{Student ID (if relevant)}\n{Your Email}\n{Your Phone Number}"
      },
      {
        "title": "Extension Request",
        "template": "Subject: Extension Request for {Assignment Name} - {Your Name, Course Number}\n\nDear Professor {Last Name},\n\nI hope this email finds you well. I am writing to request an extension for the {Assignment Name} that is currently due on {Due Date}.\n\nDue to {concise explanation of circumstances - illness, family emergency, etc.}, I have been unable to dedicate the necessary time to complete this assignment to the best of my ability. {Provide brief, relevant details without oversharing}.\n\nI have completed {mention progress made so far, if applicable} and would be able to submit the completed assignment by {proposed new deadline}. I understand the importance of this assignment in relation to our coursework, and I assure you that with this extension, I will be able to submit work that better reflects my capabilities and understanding of the material.\n\nI appreciate your consideration of this request and understand if it is not possible given the course structure. Please let me know if you require any documentation or if there is anything else I can provide.\n\nThank you for your understanding.\n\nSincerely,\n{Your Name}\n{Student ID}\n{Course Number and Section}"
      }
    ],
    "cover_letter": [
      {
        "title": "Entry Level Position",
        "template": "{Your Name}\n{Your Address}\n{Your Email}\n{Your Phone Number}\n\n{Date}\n\n{Recipient's Name}\n{Their Title}\n{Company Name}\n{Company Address}\n\nDear {Mr./Ms. Last Name},\n\nI am writing to express my interest in the {Position Title} position at {Company Name}, as advertised on {where you found the job posting}. As a recent graduate with a {Your Degree} in {Your Field} from {Your University}, I am eager to apply my skills and knowledge in {relevant skills} to contribute to your team.\n\nDuring my academic career, I {highlight relevant experiences, projects, or coursework}. Additionally, through my {internship/work experience/leadership role} at {Organization Name}, I developed strong skills in {relevant skills that match job requirements}. {Provide a specific example of an achievement or contribution}.\n\nI am particularly drawn to {Company Name} because of {specific reason - company values, projects, reputation, etc.}. Your company's commitment to {specific company initiative or value} aligns perfectly with my own professional interests and goals in {your professional interest related to the position}.\n\nThe opportunity to {mention specific responsibilities from job description} excites me, as it would allow me to apply my knowledge of {relevant skill/experience} while continuing to develop professionally in a dynamic environment.\n\nThank you for considering my application. I am excited about the possibility of joining the team at {Company Name} and would welcome the opportunity to discuss how I can contribute to your organization's success. I look forward to hearing from you.\n\nSincerely,\n\n{Your Name}"
      }
    ],
    "follow_up": [
      {
        "title": "After Job Interview",
        "template": "Subject: Thank You - {Position Title} Interview\n\nDear {Interviewer's Name},\n\nI hope this email finds you well. I wanted to take a moment to thank you for the opportunity to interview for the {Position Title} position on {Interview Date}. I appreciated learning more about {specific topic discussed} and the role's responsibilities.\n\nOur conversation reinforced my enthusiasm for the position and for joining the team at {Company Name}. {Reference something specific from the interview that went well or that you found particularly interesting}.\n\nAfter our discussion, I am confident that my background in {relevant experience/skills} and my passion for {relevant field/interest} would enable me to make valuable contributions to your team.\n\n{Optional: Address any point you wished to elaborate on or clarify from the interview}.\n\nPlease don't hesitate to contact me if you need any additional information to support my application. I look forward to hearing from you about the next steps in the process.\n\nThank you again for your time and consideration.\n\nBest regards,\n{Your Name}\n{Your Phone Number}\n{Your Email}"
      },
      {
        "title": "Application Status Follow-up",
        "template": "Subject: Following Up - {Position Title} Application\n\nDear {Recipient's Name},\n\nI hope this email finds you well. I am writing to follow up on my application for the {Position Title} position that I submitted on {Application Date}.\n\nI remain very interested in this opportunity as my {relevant skills/experiences} align well with the requirements outlined in the job description. In particular, my experience with {specific relevant experience} has prepared me to {specific job responsibility}.\n\nI understand that the hiring process can take time, and I'm wondering if you could provide any information regarding the timeline or status of my application. I am eager to discuss how I can contribute to {Company Name} and would be happy to provide any additional information that might be helpful for your consideration.\n\nThank you for your time. I look forward to hearing from you.\n\nBest regards,\n{Your Name}\n{Your Phone Number}\n{Your Email}"
      }
    ]
  }